from flask import Flask, render_template

app = Flask(__name__, static_folder='./css')



# 編成データ
team_data = {
    # バージョンごとのデータはここに入力していく
    "ver.4.4第二期": {
        "1位 11.2%・前後比率1:99": ["ティナリ", "八重神子(やえみこ)", "鍾離(しょうり)", "ナヒーダ"],
        "2位 10.4%・前後比率9:91": ["イェラン(夜蘭)", "ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "3位 7.5%・前後比率84:16": ["魈(ショウ)", "閑雲(留雲借風真君)", "フリーナ", "ファルザン"],
        "4位 5.8%・前後比率59:41": ["ヌヴィレット", "カズハ(楓原万葉)", "白朮", "フリーナ"],
        "5位 5.8%・前後比率54:46": ["アルハイゼン", "ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "6位 5.7%・前後比率12:88": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "行秋(ゆくあき)"],
        "7位 5.3%・前後比率88:12": ["タルタリヤ", "カズハ(楓原万葉)", "ベネット", "香菱(しゃんりん)"],
        "8位 4.3%・前後比率95:5": ["雷電将軍", "行秋(ゆくあき)", "ベネット", "香菱(しゃんりん)"],
        "9位 4.1%・前後比率51:49": ["雷電将軍", "カズハ(楓原万葉)", "ベネット", "九条裟羅(くじょうさら)"],
        "10位 4%・前後比率97:3": ["神里綾華", "カズハ(楓原万葉)", "珊瑚宮心海", "申鶴(しんかく)"],
        "11位 3.8%・前後比率55:45": ["ヌヴィレット", "カズハ(楓原万葉)", "鍾離(しょうり)", "フリーナ"],
        "12位 3.6%・前後比率56:44": ["雷電将軍","イェラン(夜蘭)","ベネット", "香菱(しゃんりん)"],
        "13位 3.3%・前後比率4:96": ["アルハイゼン", "イェラン(夜蘭)", "ナヒーダ", "久岐忍(くきしのぶ)"],
        "14位 2.7%・前後比率65:35": ["ヌヴィレット", "カズハ(楓原万葉)", "フリーナ", "シャルロット"],
        "15位 2.4%・前後比率90:10": ["放浪者(スカラマシュ)", "ベネット", "鍾離(しょうり)", "ファルザン"],
        "16位 2.2%・前後比率8:92": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "フリーナ"],
        "17位 2.2%・前後比率33:67": ["カズハ(楓原万葉)", "珊瑚宮心海", "イェラン(夜蘭)", "フリーナ"],
        "18位 2.1%・前後比率31:69": ["雷電将軍","イェラン(夜蘭)", "フリーナ","ジン"],
        "19位 1.9%・前後比率13:87": ["ナヒーダ","フリーナ","行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "20位 1.8%・前後比率2:98": ["雷電将軍", "ティナリ",  "鍾離(しょうり)", "ナヒーダ"],
    },
    "ver.4.4第一期": {
        "1位 11.4%・前後比率2:98": ["ティナリ", "八重神子(やえみこ)", "鍾離(しょうり)", "ナヒーダ"],
        "2位 8.9%・前後比率12:88": ["イェラン(夜蘭)", "ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "3位 7.5%・前後比率69:31": ["ヌヴィレット", "カズハ(楓原万葉)", "白朮", "フリーナ"],
        "4位 6.6%・前後比率55:45": ["アルハイゼン", "ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "5位 6.5%・前後比率15:85": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "行秋(ゆくあき)"],
        "6位 5.9%・前後比率86:14": ["タルタリヤ", "カズハ(楓原万葉)", "ベネット", "香菱(しゃんりん)"],
        "7位 5.3%・前後比率96:4": ["神里綾華", "カズハ(楓原万葉)", "珊瑚宮心海", "申鶴(しんかく)"],
        "8位 4.9%・前後比率46:54": ["雷電将軍", "カズハ(楓原万葉)", "ベネット", "九条裟羅(くじょうさら)"],
        "9位 4.8%・前後比率94:6": ["雷電将軍", "行秋(ゆくあき)", "ベネット", "香菱(しゃんりん)"],
        "10位 4.5%・前後比率50:50": ["雷電将軍", "イェラン(夜蘭)", "ベネット", "香菱(しゃんりん)"],
        "11位 4.4%・前後比率60:40": ["ヌヴィレット", "カズハ(楓原万葉)", "鍾離(しょうり)", "フリーナ"],
        "12位 3.5%・前後比率72:28": ["ヌヴィレット", "カズハ(楓原万葉)", "フリーナ", "シャルロット"],
        "13位 3.3%・前後比率6:94": ["アルハイゼン", "イェラン(夜蘭)", "ナヒーダ", "久岐忍(くきしのぶ)"],
        "14位 3%・前後比率35:65": ["雷電将軍","イェラン(夜蘭)", "フリーナ","ジン"],
        "15位 2.8%・前後比率39:61": ["カズハ(楓原万葉)", "珊瑚宮心海", "イェラン(夜蘭)", "フリーナ"],
        "16位 2.5%・前後比率85:15": ["魈(ショウ)", "閑雲(留雲借風真君)", "フリーナ", "ファルザン"],
        "17位 2.5%・前後比率10:90": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "フリーナ"],
        "18位 2.3%・前後比率85:15": ["放浪者(スカラマシュ)", "ベネット", "鍾離(しょうり)", "ファルザン"],
        "19位 2.3%・前後比率57:43": ["ヌヴィレット", "鍾離(しょうり)", "フリーナ", "ジン"],
        "20位 1.5%・前後比率29:71": ["雷電将軍", "シュヴルーズ", "ベネット", "香菱(しゃんりん)"],
    },
    "ver4.3第二期": {
        "1位 13%・前後比率77:23": ["アルハイゼン", "ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "2位 8.6%・前後比率97:3": ["雷電将軍", "行秋(ゆくあき)", "ベネット", "香菱(しゃんりん)"],
        "3位 8.2%・前後比率99:1": ["ナヴィア", "鍾離(しょうり)", "ベネット", "香菱(しゃんりん)"],
        "4位 7.2%・前後比率0:100": ["ヌヴィレット", "カズハ(楓原万葉)", "白朮", "フリーナ"],
        "5位 5.8%・前後比率0:100": ["ヌヴィレット", "カズハ(楓原万葉)", "鍾離(しょうり)", "フリーナ"],
        "6位 4.3%・前後比率51:49": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "行秋(ゆくあき)"],
        "7位 3.8%・前後比率59:41": ["ティナリ", "八重神子(やえみこ)", "鍾離(しょうり)", "ナヒーダ"],
        "8位 3.5%・前後比率0:100": ["ヌヴィレット", "カズハ(楓原万葉)", "フリーナ", "シャルロット"],
        "9位 3.5%・前後比率86:14": ["雷電将軍", "イェラン(夜蘭)", "ベネット", "香菱(しゃんりん)"],
        "10位 3.1%・前後比率33:67": ["タルタリヤ", "カズハ(楓原万葉)", "ベネット", "香菱(しゃんりん)"],
        "11位 3.1%・前後比率0:100": ["カズハ(楓原万葉)", "珊瑚宮心海", "イェラン(夜蘭)", "フリーナ"],
        "12位 3.1%・前後比率100:0": ["雷電将軍", "カズハ(楓原万葉)", "ベネット", "九条裟羅(くじょうさら)"],
        "13位 3%・前後比率52:48": ["放浪者(スカラマシュ)", "ベネット", "鍾離(しょうり)", "ファルザン"],
        "14位 3%・前後比率55:45": ["鍾離(しょうり)","ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "15位 2.7%・前後比率0:100": ["ヌヴィレット", "鍾離(しょうり)", "フリーナ", "ジン"],
        "16位 2.7%・前後比率27:73": ["イェラン(夜蘭)","ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "17位 2.5%・前後比率38:62": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "フリーナ"],
        "18位 1.6%・前後比率99:1": ["雷電将軍", "シュヴルーズ", "ベネット", "香菱(しゃんりん)"],
        "19位 1.5%・前後比率92:8": ["リネ","鍾離(しょうり)","ベネット", "香菱(しゃんりん)"],
        "20位 1.5%・前後比率5:95": ["雷電将軍","イェラン(夜蘭)", "フリーナ","ジン"],
    },
    "ver.4.3第一期": {
        "1位 14.4%・前後比率78:22": ["アルハイゼン", "ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "2位 7.5%・前後比率1:99": ["ヌヴィレット", "カズハ(楓原万葉)", "白朮", "フリーナ"],
        "3位 7.4%・前後比率98:2": ["ナヴィア", "鍾離(しょうり)", "ベネット", "香菱(しゃんりん)"],
        "4位 6.6%・前後比率95:5": ["雷電将軍", "行秋(ゆくあき)", "ベネット", "香菱(しゃんりん)"],
        "5位 6.3%・前後比率1:99": ["ヌヴィレット", "カズハ(楓原万葉)", "鍾離(しょうり)", "フリーナ"],
        "6位 4.7%・前後比率54:46": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "行秋(ゆくあき)"],
        "7位 4.4%・前後比率55:45": ["ティナリ", "八重神子(やえみこ)", "鍾離(しょうり)", "ナヒーダ"],
        "8位 4%・前後比率84:16": ["雷電将軍", "イェラン(夜蘭)", "ベネット", "香菱(しゃんりん)"],
        "9位 3.7%・前後比率1:99": ["ヌヴィレット", "カズハ(楓原万葉)", "フリーナ", "シャルロット"],
        "10位 3.5%・前後比率27:73": ["タルタリヤ", "カズハ(楓原万葉)", "ベネット", "香菱(しゃんりん)"],
        "11位 3.3%・前後比率58:42": ["放浪者(スカラマシュ)", "ベネット", "鍾離(しょうり)", "ファルザン"],
        "12位 3.3%・前後比率1:99": ["カズハ(楓原万葉)", "珊瑚宮心海", "イェラン(夜蘭)", "フリーナ"],
        "13位 3.2%・前後比率56:44": ["鍾離(しょうり)","ナヒーダ", "行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
        "14位 2.8%・前後比率1:99": ["ヌヴィレット", "鍾離(しょうり)", "フリーナ", "ジン"],
        "15位 2.5%・前後比率41:59": ["フータオ(胡桃)", "鍾離(しょうり)", "イェラン(夜蘭)", "フリーナ"],
        "16位 1.8%・前後比率32:68": ["神里綾華", "カズハ(楓原万葉)", "珊瑚宮心海", "申鶴(しんかく)"],
        "17位 1.7%・前後比率74:26": ["アルハイゼン", "八重神子(やえみこ)", "鍾離(しょうり)", "ナヒーダ"],
        "18位 1.7%・前後比率84:16": ["ナヴィア", "鍾離(しょうり)","フリーナ","ベネット"],
        "19位 1.6%・前後比率93:7": ["リネ","鍾離(しょうり)","ベネット", "香菱(しゃんりん)"],
        "20位 1.1%・前後比率83:17": ["ナヒーダ","白朮","行秋(ゆくあき)", "久岐忍(くきしのぶ)"],
    },
}

# キャラクターの使用率を計算する関数
def calculate_character_usage(version):
    character_usage = {}
    
    if version in team_data:
        teams = team_data[version]
        total_teams = len(teams)
        
        for team_name, characters in teams.items():
            for character in characters:
                character_usage[character] = character_usage.get(character, 0) + 1

        for character, usage_count in character_usage.items():
            character_usage[character] = round((usage_count / total_teams) * 100, 1)  # 小数点以下1桁に丸める

        # 使用率でキャラクターをソートする
        character_usage = dict(sorted(character_usage.items(), key=lambda item: item[1], reverse=True))

    return character_usage



# メインページ
@app.route('/')
def index():
    return render_template('index.html', versions=team_data.keys())

# バージョンごとのページ
@app.route('/version/<version>')
def version_detail(version):
    version_character_usage = calculate_character_usage(version)
    
    if version_character_usage:
        teams = team_data.get(version, {})
        return render_template('version_detail.html', version=version, teams=teams, character_usage=version_character_usage)
    else:
        return "バージョンが存在しません"

if __name__ == '__main__':
    app.run(debug=True)